README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-23 Sat 15:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Morphic Stack: The future of auto scaling is auto containerization</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David Rojas" />
</head>
<body>
<div id="content">
<h1 class="title">Morphic Stack: The future of auto scaling is auto containerization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgea75497">1. TODOs</a>
<ul>
<li><a href="#orgd81173d">1.1. The future of auto scaling is auto partitioning</a></li>
<li><a href="#org216a6a8">1.2. How it works</a></li>
</ul>
</li>
<li><a href="#orgcddd405">2. Goals</a></li>
<li><a href="#org65c87b4">3. Focus</a></li>
<li><a href="#org6973d2a">4. <span class="todo TODO">TODO</span> Features</a></li>
</ul>
</div>
</div>
<p>
An experiment about auto scaling and microservices patterns in kubernetes
</p>



<p>
Similar Projects
</p>
<ul class="org-ul">
<li><a href="https://github.com/GoogleContainerTools/jib">Jib</a></li>
</ul>

<div id="outline-container-orgea75497" class="outline-2">
<h2 id="orgea75497"><span class="section-number-2">1</span> TODOs</h2>
<div class="outline-text-2" id="text-1">
</div>
<ol class="org-ol">
<li><a id="orge5cab3e"></a><span class="todo TODO">TODO</span> NPM Tarball Functor Server / Package as a Service<br />
<ol class="org-ol">
<li><a id="orgebdb8d1"></a><span class="todo TODO">TODO</span> npm i &#x2013;save <a href="http://morphic-packages/rpc-client/hello-world?v=0.0.0">http://morphic-packages/rpc-client/hello-world?v=0.0.0</a><br />
<div class="outline-text-7" id="text-1-0-0-0-1-1">
<p>
From our heart to your node-modules
</p>
</div>
</li>
</ol>
</li>
<li><a id="orgd5afc0a"></a><span class="todo TODO">TODO</span> HATEOAS codegen<br />
<ol class="org-ol">
<li><a id="orgca1aec1"></a><span class="todo TODO">TODO</span> hygen rest-mod new &#x2013;in examples &#x2013;name hello-rest<br /></li>
<li><a id="orgf83b39c"></a><span class="todo TODO">TODO</span> hygen rest-api new &#x2013;in examples &#x2013;name rest-simple<br /></li>
</ol>
</li>
<li><a id="orgf832364"></a><span class="done DONE">DONE</span> RPC codegen<br />
<div class="outline-text-6" id="text-1-0-0-0-3">
</div>
<ol class="org-ol">
<li><a id="orgc3f2106"></a><span class="done DONE">DONE</span> hygen rpc-mod new &#x2013;in examples &#x2013;name hello-rpc<br />
<div class="outline-text-7" id="text-1-0-0-0-3-1">
</div>
</li>
<li><a id="org19de197"></a><span class="done DONE">DONE</span> hygen rpc-api new &#x2013;in examples &#x2013;name rpc-simple<br />
<div class="outline-text-7" id="text-1-0-0-0-3-2">
</div>
</li>
</ol>
</li>
<li><a id="org408b6c2"></a><span class="done DONE">DONE</span> REST codegen<br />
<div class="outline-text-6" id="text-1-0-0-0-4">
</div>
<ol class="org-ol">
<li><a id="orge51e923"></a><span class="done DONE">DONE</span> hygen rest-mod new &#x2013;in examples &#x2013;name hello-rest<br />
<div class="outline-text-7" id="text-1-0-0-0-4-1">
</div>
</li>
<li><a id="orgb455974"></a><span class="done DONE">DONE</span> hygen rest-api new &#x2013;in examples &#x2013;name rest-simple<br />
<div class="outline-text-7" id="text-1-0-0-0-4-2">
</div>
</li>
</ol>
</li>
<li><a id="org4b3e861"></a><span class="todo TODO">TODO</span> GraphQL codegen<br /></li>
<li><a id="org948b12c"></a><span class="todo TODO">TODO</span> K8s codegen<br /></li>
<li><a id="org41036d3"></a><span class="todo TODO">TODO</span> Instrumentation<br /></li>
<li><a id="org0a3514a"></a><span class="todo TODO">TODO</span> Auto partitioning<br /></li>
</ol>

<div id="outline-container-orgd81173d" class="outline-3">
<h3 id="orgd81173d"><span class="section-number-3">1.1</span> The future of auto scaling is auto partitioning</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The explosive success of containerized patterns powered by orchestrators like k8s or mesos is here to stay.
Nevertheless at the moment of writing this there is space not yet fully explored in the containerized cloud world.
That space is best described by applying the concept of auto-scaling not to the multiplication or reduction of identical deployments
but to the division of a deployment into smaller modules. 
The degree of partitioning of a stack can be called its "modularity".
</p>

<p>
A new deployment starts with zero performance metrics therefore partitioning is resolved by configuration.
Instrumentation drives auto scaling and auto partitioning according to configuration.
Project-level configuration 
</p>

<p>
Auto-scaling manages the replication numbers.
Auto-containerization manages degrees of modularity.
</p>
</div>
</div>

<div id="outline-container-org216a6a8" class="outline-3">
<h3 id="org216a6a8"><span class="section-number-3">1.2</span> How it works</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Morphic CLI is not meant to operate during development
Instead it is designed as a build tool with a focus on automation
</p>

<p>
The CLI empowers CI and automation of kubernetes operations for auto scaling and auto containerization.
</p>

<div class="org-src-container">
<pre class="src src-bash">morphic partition utils packages/utils
</pre>
</div>

<ul class="org-ul">
<li>Modules
Basic features and business logic</li>
<li>Services
Public APIs and internal APIs of any kind like GraphQL or REST
Partitioning containerize and wraps modules providing internal APIs 
<ul class="org-ul">
<li>Public</li>
<li>Internal</li>
</ul></li>
<li>Applications
Allow users interact with your applications
<ul class="org-ul">
<li>Web Apps</li>
<li>Mobile Apps</li>
<li>Command Line Applications</li>
<li>SDKs</li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgcddd405" class="outline-2">
<h2 id="orgcddd405"><span class="section-number-2">2</span> Goals</h2>
<div class="outline-text-2" id="text-2">
<p>
In isomorphic stacks you can share
</p>

<ul class="org-ul">
<li>patterns</li>
<li>schemas</li>
<li>development techniques in general</li>
</ul>
</div>
</div>

<div id="outline-container-org65c87b4" class="outline-2">
<h2 id="org65c87b4"><span class="section-number-2">3</span> Focus</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>flexibility</li>
</ul>
</div>
</div>

<div id="outline-container-org6973d2a" class="outline-2">
<h2 id="org6973d2a"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Features</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Definitions: pre-defined resources
<ul class="org-ul">
<li>Schemas
<ul class="org-ul">
<li>JSON Schema</li>
<li>Avro</li>
</ul></li>
<li>Handlers
<ul class="org-ul">
<li>Nodejs</li>
<li>Java</li>
<li>Python</li>
<li>Ruby</li>
</ul></li>
<li>Effects (find a better name)</li>
</ul></li>
<li>Schemas:</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Rojas</p>
<p class="date">Created: 2019-11-23 Sat 15:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
